---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceInvalidSpacing
source: html/e1c3f547-1802-f5fd-17cc-f43562a92c60.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceInvalidSpacing Property

Constraints not satisfied, cannot generate gridlines.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceInvalidSpacing { get; }
```